> Hello [@jtrebaol](https://github.com/jtrebaol), you can use the new resource `ovh_cloud_project_region_network` that comes with release v1.5.0.

Following test, seems the subnet { start / end } arguments for allocation_pool are not taken into account:

==> Resource added

resource "ovh_cloud_project_region_network" "networks" {
  service_name = var.service_name
  region_name  = "EU-SOUTH-LZ-MAD-A"
  name         = "Private_network_MAD"
  provider     = ovh.ovh
  subnet       = {
    cidr              = "10.10.232.0/24"
    enable_dhcp       = false
    enable_gateway_ip = false
    start   = "10.10.232.50"
    end     = "10.10.232.100"
    ip_version        = 4
   }
}

==> tofu apply

  # module.ovh_network.ovh_cloud_project_region_network.networks["EU-WEST-LZ-ZRH-A"] will be created
  + resource "ovh_cloud_project_region_network" "networks" {
      + id           = (known after apply)
      + name         = "Private_network_ZRH"
      + region       = (known after apply)
      + region_name  = "EU-WEST-LZ-ZRH-A"
      + service_name = "2f23ff001e304c81a88c728cf68c739e"
      + subnet       = {
          + cidr              = "10.10.236.0/24"
          + enable_dhcp       = false
          + enable_gateway_ip = false
          + ip_version        = 4
        }
      + visibility   = (known after apply)
      + vlan_id      = (known after apply)
    }

==> Result: allocation pool is set to 10.10.232.1 - 10.10.232.254 which is not expected

$ tofu state show module.ovh_network.ovh_cloud_project_region_network.networks[\"EU-SOUTH-LZ-MAD-A\"]
# module.ovh_network.ovh_cloud_project_region_network.networks["EU-SOUTH-LZ-MAD-A"]:
resource "ovh_cloud_project_region_network" "networks" {
    id           = "3216a768-f5e9-4a23-a139-d4427c46df9c"
    name         = "Private_network_MAD"
    region_name  = "EU-SOUTH-LZ-MAD-A"
    service_name = "2f23ff001e304c81a88c728cf68c739e"
    subnet       = {
        cidr              = "10.10.232.0/24"
        enable_dhcp       = false
        enable_gateway_ip = false
        ip_version        = 4
    }
    visibility   = "private"
}